// "number" + 3 перетворює "3" в строку і додає до "number", і потім 3 додається до результату.
console.log('number' + 3 + 3); // "number33"
// null перетворюється в 0, і потім додається до 3.
console.log(null + 3); // 3
// Логічний оператор "&&" повертає останнє значення, якщо обидва є true, тому тут повертається "qwerty".
console.log(5 && 'qwerty'); // "qwerty"
// Перші дві строки перетворюються в числа, і потім додаються разом. Потім до результату додається строка "hillel".
console.log(+'40' + +'2' + 'hillel'); // "42hillel"
// "10" - 5 не дорівнює 6, тому результат - false.
console.log('10' - 5 === 6); // false
// true перетворюється в 1, а false в 0, і потім додаються.
console.log(true + false); // 1
// Спроба відняти число від неправильної строки призводить до значення NaN.
console.log('4px' - 3); // NaN
// "4" перетворюється в число і віднімається 3.
console.log('4' - 3); // 1
// Строка "6" додається до результату 3 в степені 0 (що дорівнює 1).
console.log('6' + 3 ** 0); // "61"
// "6" перетворюється в число, і потім ділиться на 6.
console.log(12 / '6'); // 2
// Результат порівняння (5 === 6) дорівнює false, який додається до строки "10".
console.log('10' + (5 === 6)); // "10false"
// Обидва значення не є однакові, але перетворюються в false, тому результат - false.
console.log(null == ''); // false
// Результат піднесення 3 до степені 3, що дорівнює 27.
console.log(3 ** (9 / 3)); // 27
// Логічне перетворення "false" і "true" дає true, тому результат - true.
console.log(!!'false' == !!'true'); // true
// Вираз виконується зліва направо, і результат - 1.
console.log(0 || '0' && 1); // 1
// Перший операнд порівняння (0 == 0) дорівнює true, але true не менше 1, тому результат - false.
console.log((+null == false) < 1); // false
// Перший false зупиняє вираз, і результат - true.
console.log(false && true || true); // true
// Перший false в інших дужках перериває вираз, і результат - false.
console.log(false && (false || true)); // false
// Перший операнд порівняння (0 == 0) дорівнює true, але true не менше 1, тому результат - false.
console.log((+null == false) < 1 ** 5); // false


